app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "edgarsbarajas@yahoo.com"], ["LIMIT", 1]]
---
  def create
    puts("* login *" * 100)
    user = User.find_by(email: params[:email])

UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", nil], ["updated_at", "2019-02-23 19:53:34.614286"], ["id", 4]]
---
  def logout
    current_user.update(auth_token: nil)